package sub;

public class DataBean {

	// コンストラクタを作成
	public DataBean() {}

	// ------------------------------------------------------------------------

	// ランダムの値を返すメソッドhpを作成

	public int hp() {
		return (int)(Math.random() * 1000);
	}

	// ------------------------------------------------------------------------

	// ランダムの値を返すメソッドmpを作成
	public int mp() {
		return (int)(Math.random() * 1000);
	}

	// ------------------------------------------------------------------------

	// ランダムの値を返すメソッドhiを作成
	public int hi() {
		return (int)(Math.random() * 1000);
	}

	// ------------------------------------------------------------------------

	// ランダムの値を返すメソッドspを作成
	public int sp() {
		return (int)(Math.random() * 1000);
	}

	// ------------------------------------------------------------------------

	// ランダムの値を返すメソッドguを作成
	public int gu() {
		return (int)(Math.random() * 1000);
	}

}