package detaBean;

public class DetaBean {

	// 変数nameを定義
	private String name;

	// ------------------------------------------------------------------------

	// コンストラクタを作成
	public DetaBean() {}

	// ------------------------------------------------------------------------

	// 変数nameのセッターを作成
	public String getName() {
		return name;
	}
	// 変数nameのゲッターを作成
	public void setName(String name) {
		this.name = name;
	}

	// ------------------------------------------------------------------------

	// ランダムの値を返すメソッドhpを作成

	public int hp() {
		return (int)(Math.random() * 1000);
	}

	// ------------------------------------------------------------------------

	// ランダムの値を返すメソッドmpを作成
	public int mp() {
		return (int)(Math.random() * 1000);
	}

	// ------------------------------------------------------------------------

	// ランダムの値を返すメソッドhiを作成
	public int hi() {
		return (int)(Math.random() * 1000);
	}

	// ------------------------------------------------------------------------

	// ランダムの値を返すメソッドspを作成
	public int sp() {
		return (int)(Math.random() * 1000);
	}

	// ------------------------------------------------------------------------

	// ランダムの値を返すメソッドguを作成
	public int gu() {
		return (int)(Math.random() * 1000);
	}

}
